In [67]:
# Pandas: - Python library that provides data structure and methods to work with structured or tabular data, data in fast or easy way
# pandas internally uses numpy

In [68]:
# pandas 3rd party library is fast, flexible, powerfull and easy to use open source data analysis and manipulation tool, built on top of the python program

In [69]:
'''pandas supports the integration with many file formats or data sources out of the box(csv, excel, sql, json, parquet) and converts into dataframe 
vice-versa'''

'pandas supports the integration with many file formats or data sources out of the box(csv, excel, sql, json, parquet) and converts into dataframe \nvice-versa'

In [70]:
import pandas as pd

In [71]:
ser1=pd.Series([10,20,30])

In [72]:
print(ser1)

0    10
1    20
2    30
dtype: int64

In [73]:
print(type(ser1))

<class 'pandas.core.series.Series'>

In [74]:
print(ser1.dtype)

int64

In [43]:
print(ser1.index)

RangeIndex(start=0, stop=3, step=1)

In [44]:
i1=ser1.index

In [45]:
print(type(i1))

<class 'pandas.core.indexes.range.RangeIndex'>

In [46]:
v1=ser1.values

In [47]:
print(v1)

[10 20 30]

In [48]:
print(type(v1))

<class 'numpy.ndarray'>

In [49]:
# hence pandas use numpy internally

In [50]:
# we can give indexing by mentioning under index

In [51]:
ser2=pd.Series([10,20,30,40],index=[1,2,3,4])

In [52]:
print(ser2)

1    10
2    20
3    30
4    40
dtype: int64

In [53]:
ser3=pd.Series(range(10,60,10),index=range(1,6,1))

In [54]:
print(ser3)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [55]:
v2=ser2.values

In [56]:
print(v2)

[10 20 30 40]

In [57]:
v3=ser3.values

In [58]:
print(v3)

[10 20 30 40 50]

In [59]:
# here we started index by 1 so 
print(ser3[1])

10

In [60]:
print(ser3[3])

30

In [61]:
ser4=pd.Series(range(10,40,10),index=['a','b','c'])

In [62]:
ser4

a    10
b    20
c    30
dtype: int64

In [63]:
# to fetch data using inner index we have an option called as loc and iloc

In [64]:
# iloc-inner index
# loc-outer index

print(ser3)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [65]:
ser3.iloc[0]

10

In [76]:
ser3.loc[0]

KeyError: 0

In [77]:
# we need to give exactly same number of index points to store

In [78]:
ser5=pd.Series(range(10,60,10),index=range(1,3,1))

ValueError: Length of values (5) does not match length of index (2)

In [ ]:
# length of the series should be equal to length of the indexes

In [92]:
ser6=pd.Series([10,20,30], index=['Naveen','Veeresh','Shetter'])

In [93]:
print(ser6)

Naveen     10
Veeresh    20
Shetter    30
dtype: int64

In [94]:
ser7=pd.Series([10,20,30], index=['Naveen','Naveen','Naveen'])

In [95]:
print(ser7)

Naveen    10
Naveen    20
Naveen    30
dtype: int64

In [96]:
# Series are mutable

In [97]:
ser6.loc['Naveen']=89

In [98]:
print(ser6)

Naveen     89
Veeresh    20
Shetter    30
dtype: int64

In [99]:
ser7.loc['Naveen'].iloc[-1]=44

C:\Users\Skyline Solutions\AppData\Local\Temp\ipykernel_7084\3176042359.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ser7.loc['Naveen'].iloc[-1]=44

In [100]:
print(ser7)

Naveen    10
Naveen    20
Naveen    44
dtype: int64

In [101]:
# to add or we call this operations as broadcasting(means parallel operation)

In [102]:
print(ser6+1)

Naveen     90
Veeresh    21
Shetter    31
dtype: int64

In [103]:
print(ser6)

Naveen     89
Veeresh    20
Shetter    30
dtype: int64

In [104]:
# get whose marks are greater than 100

In [105]:
ser6>100

Naveen     False
Veeresh    False
Shetter    False
dtype: bool

In [106]:
ser6>67

Naveen      True
Veeresh    False
Shetter    False
dtype: bool

In [107]:
ser6[ser6>80]

Naveen    89
dtype: int64

In [108]:
import numpy as np

ser7=pd.Series(np.random.randint(1,10,5))

In [109]:
print(ser7)

0    1
1    8
2    4
3    1
4    8
dtype: int32

In [110]:
# to print even numbers in series

ser7[ser7%2==0]

1    8
2    4
4    8
dtype: int32

In [111]:
print(ser7.loc[1])

8

In [112]:
print(ser7.loc[1::])

1    8
2    4
3    1
4    8
dtype: int32

In [113]:
# creating series using addict

matches_won={'IN':9,'PAK':4,'SA':7,'ENG':3,'AFG':4}

print(matches_won)

{'IN': 9, 'PAK': 4, 'SA': 7, 'ENG': 3, 'AFG': 4}

In [114]:
s1=pd.Series(matches_won)

In [115]:
print(s1)

IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64

In [116]:
# NAN is a value used to represent a missing value in both pd and np

In [117]:
ser9=pd.Series(matches_won)

In [118]:
print(ser9)

IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64

In [119]:
print(ser9.index)

Index(['IN', 'PAK', 'SA', 'ENG', 'AFG'], dtype='object')

In [120]:
print(ser9.value_counts)

<bound method IndexOpsMixin.value_counts of IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64>

In [121]:
print(ser9.values)

[9 4 7 3 4]

In [122]:

ser9=pd.Series(matches_won,index=['PAK','SA','BR'])

In [123]:
print(ser9)

PAK    4.0
SA     7.0
BR     NaN
dtype: float64

In [124]:
print(type(ser9))

<class 'pandas.core.series.Series'>

In [125]:
print(ser9.dtype)

float64

In [126]:
ser10=pd.Series([10,20,30,'H'])

In [127]:
ser10

0    10
1    20
2    30
3     H
dtype: object

In [128]:
print(type(ser10))

<class 'pandas.core.series.Series'>

In [129]:
ser11=pd.Series({'nov':90,'ver':96})

In [130]:
print(ser11)

nov    90
ver    96
dtype: int64

In [131]:
ser12=pd.Series({'nov':89,'ver':96})

In [132]:
print(ser12)

nov    89
ver    96
dtype: int64

In [133]:
# we can add or do any arithmatic operation like

print(ser11+ser12)

nov    179
ver    192
dtype: int64

In [134]:
total=ser11+ser12

In [ ]:
print(total)

In [ ]:
print(type(total))

In [ ]:
print(total.isnull())

In [ ]:
print(total[total.isnull()])

In [ ]:
print(total[total.notnull()])

In [ ]:
ser11=pd.Series({'Naveen':90,'Veeresh':95,'Shetter':98})

In [ ]:
print(ser11)

In [ ]:
# ascending

In [ ]:
print(ser11.sort_values(ascending=True))

In [ ]:
print(ser11.sort_values(ascending=False))

In [ ]:
# dataframes

In [ ]:
data1={'name':['Naveen','Veeresh','Shetter'],'marks':[10,20,30],'age':[20,19,90]}

In [ ]:
print(data1)

In [ ]:
df1=pd.DataFrame(data1)

In [ ]:
print(df1)

In [ ]:
print(type(df1))

In [ ]:
df1.index

In [ ]:
df1.values

In [ ]:
df1.columns

In [ ]:
# to make a dataframe all have same length

In [ ]:
df1.index

In [ ]:
df1.columns

In [ ]:
df1.values

In [ ]:
data=data1

In [ ]:
df2=pd.DataFrame(data,columns=['ids','percent','grades'])

In [ ]:
df2

In [ ]:
df2=pd.DataFrame(data,columns=['ids','percents','grades'])

In [ ]:
print(df2)

In [ ]:
df3=pd.DataFrame(data,index=data['name'],columns=['ids','percents'])

In [ ]:
df3

In [ ]:
print(data)

In [ ]:
print(type(data))

In [ ]:
print(data1)

In [ ]:
print(type(data1))

In [ ]:
df1

In [ ]:
# drop or deleting a column

In [ ]:
data={'name':['Naveen','Veeresh','Shetter'],
     'ids':[101,102,103],
     'percents':[89,90,97]}

In [ ]:
data

In [ ]:
df2=pd.DataFrame(data)

In [ ]:
print(df2)

In [ ]:
# # drop or deleting a column

In [ ]:
df2.drop(['percents'],axis=1)

In [ ]:
print(df2)

In [ ]:
# here it is not deleted completely so you need to delete by putting inplace=True

In [ ]:
df3=pd.DataFrame(data)

In [ ]:
df3

In [ ]:
df3.drop(['percents'],axis=1,inplace=True)

In [ ]:
print(df3)

In [ ]:
# now to delete a row

In [ ]:
df3.drop([0],axis=0,inplace=True)

In [ ]:
print(df3)

In [ ]:
df3['percents']=[10,20]

In [ ]:
df3

In [ ]:
df3['pe']=[10,20,30]

# here while creating, we can add directly but index length should be same

In [ ]:
df3

In [ ]:
df2

In [ ]:
df2['percents']>90

In [ ]:
df2[df2['percents']>90]

In [ ]:
df2[df2['percents']<90]

In [ ]:
df2[df2['percents']==90]

In [ ]:
arr1=np.where(df2['percents']>=90,'yes','no')

In [ ]:
arr1

In [ ]:
print(arr1)

In [ ]:
df2['good']=arr1

In [ ]:
df2

In [ ]:
df2.loc[3]=['Ling','104','100','yes']

In [ ]:
df2

In [ ]:
# the above thing can be done by

In [ ]:
def cal_grades(percent):
    if percent>=95:
        return 'A'
    else:
        return 'B'

df2['grades']=df2['percents'].apply(cal_grades)

In [ ]:
df2.drop([3],axis=0,inplace=True)

In [ ]:
df2

In [ ]:
df2.loc[3]=['Ling','104',100,'yes']

In [ ]:
df2

In [ ]:
print(type(df2['percents']))

In [ ]:
def cal_grades(percent):
    if percent>=95:
        return 'A'
    else:
        return 'B'

df2['grades']=df2['percents'].apply(cal_grades)

In [ ]:
df2

In [ ]:
df2.describe

In [ ]:
df2.describe()

In [ ]:
# 15nov

In [ ]:
data={'Company':['A','B','C','D'],
     'Year':[2019,2020,2021,2022],
     'Sales':[100,89,90,91],
     'Profits':[11,9,4,5]}

In [ ]:
df1=pd.DataFrame(data)

In [ ]:
df1

In [ ]:
df1['Year']

In [ ]:
df1.describe()

In [ ]:
df1.isnull()

In [ ]:
df1.isnull

In [ ]:
print(type(df1['Year'][0]))

In [ ]:
df1['Year']

In [ ]:
# type convertion

In [ ]:
df1.describe(include=None)

In [ ]:
df1.info()

In [ ]:
df1['Year'].astype(object)

In [ ]:
df1.info()

In [ ]:
df1['Company']

In [ ]:
df1['Year'].value_counts()

In [ ]:
df1['Profits']

In [ ]:
df1['Sales']

In [ ]:
# fetch the rows which has only company B

In [ ]:
df1['Company']=='B'

In [ ]:
df1[df1['Company']=='B']

In [ ]:
df1[df1['Sales']>=90]

In [ ]:
df1[df1['Sales']>=90]['Company']

In [ ]:
df1[df1['Sales']>=90]['Profits']

In [ ]:
df1[df1['Company']=='B']

In [ ]:
df1['Company']

In [ ]:
df1[df1['Company']=='B']

In [ ]:
df1[df1['Company']=='B']['Sales']

In [ ]:
df1[df1['Sales']>70].value_counts()

In [ ]:
df1[df1['Profits']<70]['Profits']

In [ ]:
df1[df1['Profits']<70][['Year','Company']]

In [ ]:
df1[(df1['Company']=='A') & (df1['Profits']<40)]

In [ ]:
df1[(df1['Sales']>100) | (df1['Profits']>10)]

In [ ]:
df1[df1['Profits']<40]

In [ ]:
# query

In [ ]:
df1.query("Company=='A'")

In [ ]:
df1.query("Company=='A' and Profits>30")

In [ ]:
df1.query("Company=='A' or Profits>30")

In [ ]:
# find mean of profit of company A

In [ ]:
df1[df1['Company']=='A']['Profits']

In [ ]:
df1[df1['Company']=='A']['Profits'].mean()

In [ ]:
df1['Company'].mode()

In [ ]:
df1['Company'].describe()

In [ ]:
df1.describe()

In [ ]:
df1['Year'].mode()

In [ ]:
df1['Year'].max()

In [ ]:
df1.info()

In [ ]:
df1.describe()

In [ ]:
df1['Sales'].quantile()

In [ ]:
df1['Sales'].quantile(.25)

In [ ]:
df1['Sales'].quantile(1)

In [ ]:
df1['Sales'].quantile(0.5)

In [ ]:
# pivot: - Index, column, and row

In [ ]:
pivot_df=df1.pivot(index='Company',columns='Year',values='Sales')

In [ ]:
print(pivot_df)

In [ ]:
pivot_df=df1.pivot(index='Company',columns='Year',values=['Sales','Profits'])

In [ ]:
print(pivot_df)

In [ ]:
df1

In [135]:
# concatination in pandas

In [136]:
# min, max, sum,  are normal python function

In [137]:
li=[1,2,3,4,5]

In [138]:
print(sum(li))

15

In [139]:
print(min(li))

1

In [140]:
print(max(li))

5

In [149]:
# for mean we need to go by numpy mean

In [150]:
print(np.mean(li))

3.0

In [151]:
print(np.median(li))

3.0

In [152]:
mean=sum(li)/len(li)

In [153]:
print(mean)

3.0

In [154]:
# concatinaton:-

In [155]:
df1={'ids':[101,102,103,104],
    'names':['Naveen','Shetty','Veeresh','Shetty'],
    'percent':[85,95,90,97]}

In [156]:
df1_1=pd.DataFrame(df1)

In [157]:
print(df1_1)

   ids    names  percent
0  101   Naveen       85
1  102   Shetty       95
2  103  Veeresh       90
3  104   Shetty       97

In [158]:
df2={'ids':[201,202,203,204],
    'names':['Naveenn','Shettyy','Veereshh','Shettyy'],
    'percent':[86,96,91,98]}

In [159]:
df2_2=pd.DataFrame(df2)

In [160]:
print(df2_2)

   ids     names  percent
0  201   Naveenn       86
1  202   Shettyy       96
2  203  Veereshh       91
3  204   Shettyy       98

In [161]:
df1_1+df2_2

   ids            names  percent
0  302    NaveenNaveenn      171
1  304    ShettyShettyy      191
2  306  VeereshVeereshh      181
3  308    ShettyShettyy      195

In [167]:
pd.concat([df1_1,df2_2])

   ids     names  percent
0  101    Naveen       85
1  102    Shetty       95
2  103   Veeresh       90
3  104    Shetty       97
0  201   Naveenn       86
1  202   Shettyy       96
2  203  Veereshh       91
3  204   Shettyy       98

In [162]:
# we need to add

In [166]:
pd.concat([df1_1,df2_2],ignore_index=True)

   ids     names  percent
0  101    Naveen       85
1  102    Shetty       95
2  103   Veeresh       90
3  104    Shetty       97
4  201   Naveenn       86
5  202   Shettyy       96
6  203  Veereshh       91
7  204   Shettyy       98

In [168]:
pd.concat([df1_1,df2_2],keys=['batch1','batch2'])

          ids     names  percent
batch1 0  101    Naveen       85
       1  102    Shetty       95
       2  103   Veeresh       90
       3  104    Shetty       97
batch2 0  201   Naveenn       86
       1  202   Shettyy       96
       2  203  Veereshh       91
       3  204   Shettyy       98

In [169]:
pd.concat([df1_1,df2_2],keys=['batch1','batch2'],axis=0)

          ids     names  percent
batch1 0  101    Naveen       85
       1  102    Shetty       95
       2  103   Veeresh       90
       3  104    Shetty       97
batch2 0  201   Naveenn       86
       1  202   Shettyy       96
       2  203  Veereshh       91
       3  204   Shettyy       98

In [170]:
pd.concat([df1_1,df2_2],keys=['batch1','batch2'],axis=1)

  batch1                  batch2
     ids    names percent    ids     names percent
0    101   Naveen      85    201   Naveenn      86
1    102   Shetty      95    202   Shettyy      96
2    103  Veeresh      90    203  Veereshh      91
3    104   Shetty      97    204   Shettyy      98

In [171]:
pd.concat([df1_1,df2_2],keys=['batch1','batch2'],axis=1,ignore_index=True)

     0        1   2    3         4   5
0  101   Naveen  85  201   Naveenn  86
1  102   Shetty  95  202   Shettyy  96
2  103  Veeresh  90  203  Veereshh  91
3  104   Shetty  97  204   Shettyy  98

In [172]:
# handling missing data using pandas python

In [173]:
student1={
    'names':['john','Alice',None,'Naveen','coral','mark','Dan'],
    'ids':[101,102,None,104,105,106,None],
    'percents':[81.5,None,91.0,None,None,77.5,88.0]
}

In [174]:
print(student1)

{'names': ['john', 'Alice', None, 'Naveen', 'coral', 'mark', 'Dan'], 'ids': [101, 102, None, 104, 105, 106, None], 'percents': [81.5, None, 91.0, None, None, 77.5, 88.0]}

In [175]:
df1=pd.DataFrame(student1)

In [176]:
df1

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [177]:
df1.isnull()

   names    ids  percents
0  False  False     False
1  False  False      True
2   True   True     False
3  False  False      True
4  False  False      True
5  False  False     False
6  False   True     False

In [178]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   names     6 non-null      object
 1   ids       5 non-null      float64
 2   percents  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

In [179]:
df1.describe()

              ids   percents
count    5.000000   4.000000
mean   103.600000  84.500000
std      2.073644   6.123724
min    101.000000  77.500000
25%    102.000000  80.500000
50%    104.000000  84.750000
75%    105.000000  88.750000
max    106.000000  91.000000

In [180]:
df1.info

<bound method DataFrame.info of     names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0>

In [181]:
df1.describe

<bound method NDFrame.describe of     names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0>

In [182]:
df1.isnull().sum()

names       1
ids         2
percents    3
dtype: int64

In [183]:
# filling the None values

In [184]:
df1.fillna({'names':'Ram','ids':103,'percents':(df1['percents'].mean())})

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [185]:
# to make permanent change you can use inplce=True

In [186]:
df1.fillna({'names':'Ram','ids':103,'percents':(df1['percents'].mean())},inplace=True)

In [187]:
df1

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [188]:
df2=pd.DataFrame(df1)

In [189]:
df2

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [190]:
df2['names'][0]

'john'

In [191]:
df2['names'][0]='naveen'

C:\Users\Skyline Solutions\AppData\Local\Temp\ipykernel_7084\2980563835.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2['names'][0]='naveen'
C:\Users\Skyline Solutions\AppData\Local\Temp\ipykernel_7084\2980563835.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['names'][0]='naveen'

In [192]:
df2

    names    ids  percents
0  naveen  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [193]:
df1

    names    ids  percents
0  naveen  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [194]:
# deleting data

In [195]:
df1.drop(['names'],axis=1)

     ids  percents
0  101.0      81.5
1  102.0      84.5
2  103.0      91.0
3  104.0      84.5
4  105.0      84.5
5  106.0      77.5
6  103.0      88.0

In [196]:
df1

    names    ids  percents
0  naveen  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [197]:
df1.drop(['names'],inplace=True)

KeyError: "['names'] not found in axis"

In [198]:
df1

    names    ids  percents
0  naveen  101.0      81.5
1   Alice  102.0      84.5
2     Ram  103.0      91.0
3  Naveen  104.0      84.5
4   coral  105.0      84.5
5    mark  106.0      77.5
6     Dan  103.0      88.0

In [199]:
df1.drop(['names'],inplace=True,axis=1)

In [200]:
df1

     ids  percents
0  101.0      81.5
1  102.0      84.5
2  103.0      91.0
3  104.0      84.5
4  105.0      84.5
5  106.0      77.5
6  103.0      88.0

In [201]:
# dropna

student1={
    'names':['john','Alice',None,'Naveen','coral','mark','Dan'],
    'ids':[101,102,None,104,105,106,None],
    'percents':[81.5,None,91.0,None,None,77.5,88.0]
}

In [202]:
df3=pd.DataFrame(student1)

In [203]:
df3

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [204]:
df3.dropna()

  names    ids  percents
0  john  101.0      81.5
5  mark  106.0      77.5

In [205]:
df3

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [206]:
df3.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [207]:
df3

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [208]:
df3.dropna(axis=0)

  names    ids  percents
0  john  101.0      81.5
5  mark  106.0      77.5

In [209]:
df3

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [210]:
# thresh : - if we have atleast value should be there.

In [211]:
df3.dropna(axis=1,thresh=3)

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [212]:
df3.dropna(axis=1,thresh=2)

    names    ids  percents
0    john  101.0      81.5
1   Alice  102.0       NaN
2    None    NaN      91.0
3  Naveen  104.0       NaN
4   coral  105.0       NaN
5    mark  106.0      77.5
6     Dan    NaN      88.0

In [213]:
df3.dropna(axis=1,thresh=5)

    names    ids
0    john  101.0
1   Alice  102.0
2    None    NaN
3  Naveen  104.0
4   coral  105.0
5    mark  106.0
6     Dan    NaN